# #Есть список a.
# Выведите все элементы, которые меньше 5.

a = [1, 1, 2, 3, 5, 9, 13, 21, 3, 55, 89, 56]
for i in a:
    if i<5:
        print (i)
