# Выведите первый и последний элемент списка.

a = [1, 2, 3, 4, 5, 6, 7, 8]

print('First item on the list : ' + str(a[0]))

print('Last item on list: ' + str(a[-1]))
